var searchIndex = JSON.parse('{\
"main":{"doc":"","t":[5],"n":["main"],"q":["main"],"d":[""],"i":[0],"f":[[[]]],"p":[]},\
"rust_api":{"doc":"all_programming_net","t":[5,5,5,5,5,5,5,5,5],"n":["ajax","fact","gcd","k","lcm","math","os_name","pow","quotient_not_surplus"],"q":["rust_api","","","","","","","",""],"d":["","xからyまでの階乗","xとyの最大公約数","ケルビン温度","xとyの最小公倍数","","os判定","xの二乗","xとyの割り算の解(あまりなし)"],"i":[0,0,0,0,0,0,0,0,0],"f":[[[],[["result",4],["box",3]]],[[["i32",15]],["i32",15]],[[["i32",15]],["i32",15]],[[["i32",15]],["i32",15]],[[["i32",15]],["i32",15]],[[["i32",15]],["i32",15]],[[],["i32",15]],[[["i32",15]],["i32",15]],[[["i32",15]],["i32",15]]],"p":[]}\
}');
if (window.initSearch) {window.initSearch(searchIndex)};